AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.1.0_rc27/mcu/apollo510/regs/am_mcu_apollo510_otpinfoc.h
// CUST_WPROT4 - These bits write-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_WPROT4_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_WPROT4_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_WPROT4_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_WPROT4_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_WPROT4_CHUNKS_Msk 0xFFFFFFFF

// CUST_WPROT5 - These bits write-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_WPROT5_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_WPROT5_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_WPROT5_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_WPROT5_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_WPROT5_CHUNKS_Msk 0xFFFFFFFF

// CUST_WPROT6 - These bits write-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_WPROT6_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_WPROT6_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_WPROT6_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_WPROT6_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_WPROT6_CHUNKS_Msk 0xFFFFFFFF

// CUST_WPROT7 - These bits write-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_WPROT7_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_WPROT7_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_WPROT7_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_WPROT7_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_WPROT7_CHUNKS_Msk 0xFFFFFFFF

// CUSTOTP_PROGLOCK - customer OTP keybank program lock
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_RESERVED_S 4
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_RESERVED_M 0xFFFFFFF0
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_RESERVED(n) (((uint32_t)(n) << 4) & 0xFFFFFFF0)
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_RESERVED_Pos 4
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_RESERVED_Msk 0xFFFFFFF0
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_LOCK_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_LOCK_M 0x0000000F
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_LOCK(n) (((uint32_t)(n) << 0) & 0x0000000F)
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_LOCK_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_LOCK_Msk 0x0000000F

// CUSTOTP_RDLOCK - customer OTP keybank read lock
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_RESERVED_S 8
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_RESERVED_M 0xFFFFFF00
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_RESERVED(n) (((uint32_t)(n) << 8) & 0xFFFFFF00)
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_RESERVED_Pos 8
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_RESERVED_Msk 0xFFFFFF00
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_LOCK_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_LOCK_M 0x000000FF
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_LOCK(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_LOCK_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_LOCK_Msk 0x000000FF

// CUSTOTP_READ_KEY0 - customer OTP keybank read key[31:0]
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY0_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY0_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY0_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY0_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY0_KEY_Msk 0xFFFFFFFF

// CUSTOTP_READ_KEY1 - customer OTP keybank read key[63:32]
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY1_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY1_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY1_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY1_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY1_KEY_Msk 0xFFFFFFFF

// CUSTOTP_READ_KEY2 - customer OTP keybank read key[95:64]
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY2_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY2_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY2_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY2_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY2_KEY_Msk 0xFFFFFFFF

// CUSTOTP_READ_KEY3 - customer OTP keybank read key[127:96]
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY3_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY3_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY3_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY3_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY3_KEY_Msk 0xFFFFFFFF

// CUSTOTP_PROG_KEY0 - customer OTP keybank PROG key[31:0]
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY0_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY0_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY0_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY0_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY0_KEY_Msk 0xFFFFFFFF

// CUSTOTP_PROG_KEY1 - customer OTP keybank PROG key[63:32]
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY1_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY1_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY1_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY1_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY1_KEY_Msk 0xFFFFFFFF

// CUSTOTP_PROG_KEY2 - customer OTP keybank PROG key[95:64]
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY2_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY2_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY2_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY2_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY2_KEY_Msk 0xFFFFFFFF

// CUSTOTP_PROG_KEY3 - customer OTP keybank PROG key[127:96]
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY3_KEY_S 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY3_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY3_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY3_KEY_Pos 0
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY3_KEY_Msk 0xFFFFFFFF

// CUST_RPROT0 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT0_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT0_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT0_CHUNKS_Msk 0xFFFFFFFF

// CUST_RPROT1 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT1_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT1_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT1_CHUNKS_Msk 0xFFFFFFFF

// CUST_RPROT2 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT2_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT2_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT2_CHUNKS_Msk 0xFFFFFFFF

// CUST_RPROT3 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT3_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT3_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT3_CHUNKS_Msk 0xFFFFFFFF

// CUST_RPROT4 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT4_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT4_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT4_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT4_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT4_CHUNKS_Msk 0xFFFFFFFF

// CUST_RPROT5 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT5_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT5_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT5_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT5_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT5_CHUNKS_Msk 0xFFFFFFFF

// CUST_RPROT6 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT6_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT6_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT6_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT6_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT6_CHUNKS_Msk 0xFFFFFFFF

// CUST_RPROT7 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_OTP_INFOC_CUST_RPROT7_CHUNKS_S 0
#define AM_REG_OTP_INFOC_CUST_RPROT7_CHUNKS_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_CUST_RPROT7_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_CUST_RPROT7_CHUNKS_Pos 0
#define AM_REG_OTP_INFOC_CUST_RPROT7_CHUNKS_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT0_KEY0 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_KEYBANK_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_KEYBANK_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_KEYBANK(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_KEYBANK_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_KEYBANK_Msk 0xFFFFFFFF

